[
  {"id":"adisornDigitalProductPassport2021","abstract":"The Digital Product Passport (DPP) is a concept of a policy instrument particularly pushed by policy circles to contribute to a circular economy. The preliminary design of the DPP is supposed to have product-related information compiled mainly by manufactures and, thus, to provide the basis for more circular products. Given the lack of scientific debate on the DPP, this study seeks to work out design options of the DPP and how these options might benefit stakeholders in a product’s value chain. In so doing, we introduce the concept of the DPP and, then, describe the existing regime of regulated and voluntary product information tools focusing on the role of stakeholders. These initial results are reflected in an actor-centered analysis on potential advantages gained through the DPP. Data is generated through desk research and a stakeholder workshop. In particular, by having explored the role the DPP for different actors, we find substantial demand for further research on a variety of issues, for instance, on how to reduce red tape and increase incentives for manufacturers to deliver certain information and on how or through what data collection tool (e.g., database) relevant data can be compiled and how such data is provided to which stakeholder group. We call upon other researchers to close the research gaps explored in this paper also to provide better policy direction on the DPP.","author":[{"family":"Adisorn","given":"Thomas"},{"family":"Tholen","given":"Lena"},{"family":"Götz","given":"T."}],"DOI":"10.3390/EN14082289","issued":{"date-parts":[[2021]]},"source":"Semantic Scholar","title":"Towards a Digital Product Passport Fit for Contributing to a Circular Economy","type":"article-journal"},
  {"id":"Appropedia","abstract":"Appropedia is the site to develop and share collaborative solutions in sustainability, poverty reduction and international development through the use of sound principles and appropriate technology, original...","accessed":{"date-parts":[[2021,9,30]]},"language":"en-GB","title":"Appropedia:About","title-short":"Appropedia","type":"webpage","URL":"https://www.appropedia.org/Appropedia:About"},
  {"id":"blindImpactOpenSource2021","author":[{"family":"Blind","given":"K"},{"family":"Böhm","given":"M"},{"family":"Grzegorzweska","given":"P"},{"family":"Katz","given":"A"},{"family":"Muto","given":"S"},{"family":"Pätsch","given":"S"},{"family":"Schubert","given":"T"}],"issued":{"date-parts":[[2021]]},"publisher":"Final Study Report. Brussels: European Commission","title":"The impact of Open Source Software and Hardware on technological independence, competitiveness and innovation in the EU economy","type":"article-journal"},
  {"id":"bonvoisinStandardisationPracticesOpen2020","abstract":"Standardisation is an important component in the maturation of any field of technology. It contributes to the formation of a recognisable identity and enables interactions with a wider community. This article reviews past and current standardisation initiatives in the field of Open Source Hardware (OSH). While early initiatives focused on aspects such as licencing, intellectual property and documentation formats, recent efforts extend to ways for users to exercise their rights under open licences and to keep OSH projects discoverable and accessible online. We specifically introduce two standards that are currently being released and call for early users and contributors, the DIN SPEC 3105 and the Open Know How Manifest Specification. Finally, we reflect on challenges around standardisation in the community and relevant areas for future development such as an open tool chain, modularity and hardware specific interface standards.","accessed":{"date-parts":[[2020,8,18]]},"author":[{"family":"Bonvoisin","given":"Jérémy"},{"family":"Molloy","given":"Jenny"},{"family":"Haeuer","given":"Martin"},{"family":"Wenzel","given":"Tobias"}],"container-title":"arXiv:2004.07143 [physics]","issued":{"date-parts":[[2020,4,15]]},"source":"arXiv.org","title":"Standardisation of practices in Open Source Hardware","type":"article-journal","URL":"http://arxiv.org/abs/2004.07143"},
  {"id":"bonvoisinVielfaltUndStand2018a","abstract":"Die letzten zehn Jahre bildeten den Schauplatz für das Aufkommen einer Vielzahl von Projekten zur Entwicklung von Open-Source-Hardware (OSH), welche das dezentrale Entwicklungskonzept der Open-Source-Software (OSS) auf die Welt der physischen Produkte übertragen. Diese Projekte sind gekennzeichnet durch die Offenlegung von technischen Daten zur Stimulation von Feedback, Replikation und kollaborativer Entwicklung. Dieser Beitrag untersucht die Nutzung des öffentlichen Raums von OSH-Projekten, welcher durch das World Wide Web und Online-Plattformen zum gemeinsamen Datenaustausch bereitgestellt wird, um ihre Produkte als „open source“ zu veröffentlichen. Hierfür wird eine Stichprobe mit produktbezogenen Daten von 76 OSH-Produkten empirisch erhoben und bewertet. Einerseits werden dadurch Schlussfolgerungen zum derzeitig erreichten Entwicklungsstand des OSH-Feldes gezogen. Andererseits werden Verhaltensweisen von OSH-Projekten aufgezeigt und die Vielfalt an existierenden Ansätzen anhand von unterschiedlichen dokumentationsspezifischen Ausprägungen eingeordnet.","accessed":{"date-parts":[[2021,9,14]]},"author":[{"family":"Bonvoisin","given":"Jérémy"},{"family":"Mies","given":"Robert"},{"family":"Stark","given":"Rainer"},{"family":"Jochem","given":"Roland"}],"container-title":"Interdisziplinäre Perspektiven zur Zukunft der Wertschöpfung","DOI":"10.1007/978-3-658-20265-1_10","editor":[{"family":"Redlich","given":"Tobias"},{"family":"Moritz","given":"Manuel"},{"family":"Wulfsberg","given":"Jens P."}],"event-place":"Wiesbaden","ISBN":"978-3-658-20265-1","issued":{"date-parts":[[2018]]},"language":"de","page":"121-133","publisher":"Springer Fachmedien","publisher-place":"Wiesbaden","source":"Springer Link","title":"Vielfalt und Stand der Open-Source-Hardware","type":"chapter","URL":"https://doi.org/10.1007/978-3-658-20265-1_10"},
  {"id":"DINSPEC31051","accessed":{"date-parts":[[2021,5,6]]},"DOI":"10.31030/3173063","publisher":"Beuth Verlag GmbH","source":"DOI.org (Crossref)","title":"DIN SPEC 3105-1:2020-07, Open Source Hardware_- Teil_1: Anforderungen an die technische Dokumentation; Text Englisch","title-short":"DIN SPEC 3105-1","type":"report","URL":"https://www.beuth.de/de/-/-/324805763"},
  {"id":"ezojiRequirementsDesignReuse2021","accessed":{"date-parts":[[2021,9,10]]},"author":[{"family":"Ezoji","given":"A."},{"family":"Boujut","given":"J.F."},{"family":"Pinquié","given":"R."}],"container-title":"Procedia CIRP","container-title-short":"Procedia CIRP","DOI":"10.1016/j.procir.2021.05.042","ISSN":"22128271","issued":{"date-parts":[[2021]]},"language":"en","page":"792-797","source":"DOI.org (Crossref)","title":"Requirements for design reuse in open-source hardware: a state of the art","title-short":"Requirements for design reuse in open-source hardware","type":"article-journal","URL":"https://linkinghub.elsevier.com/retrieve/pii/S2212827121005047","volume":"100"},
  {"id":"gershenfeldFabComingRevolution2005","abstract":"Includes index; How to make -- Almost anything -- The past -- Hard ware -- The present -- Birds and bikes -- Subtraction -- Growing inventors -- Addition -- Building models -- Description -- Playing at work -- Computation -- Making sense -- Instrumentation -- Net work -- Communication -- Art and artillery -- Interaction -- The future -- Joy -- The details","accessed":{"date-parts":[[2021,10,26]]},"author":[{"family":"Gershenfeld","given":"Neil A."}],"ISBN":"978-0-465-02745-3","issued":{"date-parts":[[2005]]},"language":"eng","number-of-pages":"298","publisher":"New York : Basic Books","source":"Internet Archive","title":"Fab : the coming revolution on your desktop--from personal computers to personal fabrication","title-short":"Fab","type":"book","URL":"http://archive.org/details/fabcomingrevolut00gers"},
  {"id":"hoijuiKiCadImageQRCode2021","abstract":"A stand-alone (python) tool to replace rectangular template areas drawn onto a KiCad PCB with B&W images or QR-Codes.","accessed":{"date-parts":[[2021,9,29]]},"author":[{"family":"hoijui","given":""}],"genre":"Python","issued":{"date-parts":[[2021,8,10]]},"original-date":{"date-parts":[[2021,7,24]]},"source":"GitHub","title":"KiCad image/QR-Code injector","type":"book","URL":"https://github.com/hoijui/kicad-image-injector"},
  {"id":"hoijuiOPENNEXTOKHLOSHYAMLstatsV12021","abstract":"Gathers statistics about the keys used in a bunch of OKH YAML files","accessed":{"date-parts":[[2021,9,28]]},"author":[{"family":"Hoijui","given":""}],"DOI":"10.5281/ZENODO.5534241","issued":{"date-parts":[[2021,9,28]]},"publisher":"Zenodo","source":"DOI.org (Datacite)","title":"OPEN-NEXT/OKH-LOSH-YAML-stats: v1.0.0","title-short":"OPEN-NEXT/OKH-LOSH-YAML-stats","type":"book","URL":"https://zenodo.org/record/5534241","version":"v1.0.0"},
  {"id":"jato-espinoFosteringCircularEconomy2020","abstract":"Digital evolution underwent great progress in the late 20th century, democratizing the use of the Internet and, therefore, access to public sources of information. This technological shift caused great impacts on different fields, including Industrial Symbiosis (IS). IS stems from the concept of Circular Economy and requires well-structured information to encourage waste reuse. Under these premises, this investigation aimed at processing and analyzing existing open-access IS databases from several perspectives, including types of business areas, waste and new uses involved. In addition, existing IS data were explored with the support of different tools, such as correspondence, network and correlation analyses. The application of this methodology to a set of 496 shortlisted IS exchanges led to several findings, highlighting the strong relationship between metallurgy and the production of cement, the key role played by the electricity production sector both as a donor and a recipient, the versatility of the agriculture area due to their capacity for reusing a variety of waste as fertilizers and the importance of chemical products and steam and hot water as new uses. Overall, these results provide companies with efficient and understandable knowledge to donate or receive materials.","author":[{"family":"Jato-Espino","given":"D."},{"family":"Ruiz-Puente","given":"C."}],"DOI":"10.3390/su12030952","issued":{"date-parts":[[2020]]},"source":"Semantic Scholar","title":"Fostering Circular Economy Through the Analysis of Existing Open Access Industrial Symbiosis Databases","type":"article-journal"},
  {"id":"makernetallianceOpenKnowHow","abstract":"Open Know-How is about people being able to openly share online the tacit knowledge for how to make\nalmost anything.","accessed":{"date-parts":[[2021,9,21]]},"author":[{"family":"MakerNetAlliance","given":""}],"container-title":"StandardsRepo","title":"OpenKnowHow","type":"webpage","URL":"https://app.standardsrepo.com/MakerNetAlliance/OpenKnowHow"},
  {"id":"makernetallianceOpenKnowHowYAMLDiscussion","abstract":"Open Know-How is about people being able to openly share online the tacit knowledge for how to make\nalmost anything.","accessed":{"date-parts":[[2021,9,21]]},"author":[{"family":"MakerNetAlliance","given":""}],"container-title":"StandardsRepo","title":"OpenKnowHow - YAML discussion","type":"webpage","URL":"https://app.standardsrepo.com/MakerNetAlliance/OpenKnowHow"},
  {"id":"matheusOpenGovernmentData2014a","abstract":"The use of Information and Communication Technologies (ICTs) for information transparency in Brazil is not recent. It is possible to highlight several strategies have emerged to promote transparency of these information. This article aims to fill a gap observed in the literature regarding the use of data and information provided by governments and used by citizens and companies from the comparison with the specialized bibliography. The methodology consists of a single case study, the city of Rio de Janeiro, with review of literature in the field of e-government and open data followed by an exploratory study of the portals open data and open data policy municipality of Rio de Janeiro. Furthermore creating a simple visit to portals based on the literature review of the eight principles of open data of the Open Government Data and five stars of Tim Berners-Lee. Finally, based on the work of Zuiderjwik & Janssen (2014) pointing virtuous elements of the use cycle of open data by civil society. This work also increase an element lacking in the literature: strategies of dissemination and encouraging governments to use open data. The results indicate the scarce, but organize data can improve the performance of service delivery of a city.","author":[{"family":"Matheus","given":"Ricardo"},{"family":"Vaz","given":"Jose"},{"family":"Maia Ribeiro","given":"Manuella"}],"container-title-short":"ACM International Conference Proceeding Series","DOI":"10.1145/2691195.2691240","issued":{"date-parts":[[2014,10,1]]},"source":"ResearchGate","title":"Open Government Data and the Data Usage for Improvement of Public Services in the Rio de Janeiro City","type":"book","volume":"2014"},
  {"id":"miesDEVELOPMENTOPENSOURCE2020","abstract":"Open source hardware is hardware whose design is shared online so that anyone can study, modify, distribute, make, and sell it. In spite of the increasing popularity of this alternative IP management approach, the field of OSH remains fragmented of diverse practices seeking for settlement. This challenges providers of groupware solutions to capture the specific needs of open source product development practitioners. This contribution therefore delivers a list of basic requirements and verifies them by comparing offered functions of existing groupware solutions.","accessed":{"date-parts":[[2021,3,26]]},"author":[{"family":"Mies","given":"R."},{"family":"Bonvoisin","given":"J."},{"family":"Stark","given":"R."}],"container-title":"Proceedings of the Design Society: DESIGN Conference","DOI":"10.1017/dsd.2020.38","ISSN":"2633-7762","issued":{"date-parts":[[2020,5]]},"language":"en","page":"997-1006","publisher":"Cambridge University Press","source":"Cambridge University Press","title":"DEVELOPMENT OF OPEN SOURCE HARDWARE IN ONLINE COMMUNITIES: INVESTIGATING REQUIREMENTS FOR GROUPWARE","title-short":"DEVELOPMENT OF OPEN SOURCE HARDWARE IN ONLINE COMMUNITIES","type":"article-journal","URL":"https://www.cambridge.org/core/journals/proceedings-of-the-design-society-design-conference/article/development-of-open-source-hardware-in-online-communities-investigating-requirements-for-groupware/6568B2A11060D85843057518F6A65C60","volume":"1"},
  {"id":"moednOPENNEXTOKHLOSHV12021","abstract":"as by D3.3","accessed":{"date-parts":[[2021,10,28]]},"author":[{"family":"Moedn","given":""},{"family":"Hoijui","given":""},{"family":"Legba7","given":""},{"family":"Case06","given":""},{"family":"Damamitesh","given":""},{"family":"Penyuan","given":""},{"family":"T. Mulzer","given":""},{"family":"Emanuel","given":"Kaspar"},{"family":"Jäger","given":"Martin"},{"family":"Alinaweedmalik","given":""},{"family":"Joostbuiter","given":""},{"family":"Arancio","given":"Juli"},{"family":"Siimonnii","given":""}],"DOI":"10.5281/ZENODO.5608513","issued":{"date-parts":[[2021,10,28]]},"publisher":"Zenodo","source":"DOI.org (Datacite)","title":"OPEN-NEXT/OKH-LOSH: v1.0.0","title-short":"OPEN-NEXT/OKH-LOSH","type":"book","URL":"https://zenodo.org/record/5608513","version":"v1.0.0"},
  {"id":"moritzBestPracticesPitfalls2018","abstract":"Easy-to-use and affordable means of production (e.g. 3D printer), access to these technologies (e.g. in makerspaces) and powerful tools for online product design led to the emergence of open source hardware (OSH). Like in open source software, projects and online platforms have been evolving around physical products from various technologies where people jointly develop and freely share designs. We also find businesses that sell products made from these designs and offer complimentary services. This decentralized and collaborative model of value creation offers new opportunities for social, economic and ecological sustainability, but also calls for a different understanding beyond traditional notions. Results from an exploratory study on OSH projects and companies revealed that licensing is a critical issue, communities and partners play a key role in the open source ecosystem and modes of value creation are either centered around design or production in combination with a mix of complimentary services.","author":[{"family":"Moritz","given":"Manuel"},{"family":"Redlich","given":"Tobias"},{"family":"Wulfsberg","given":"Jens"}],"collection-title":"Advances in Intelligent Systems and Computing","container-title":"Proceedings of the International Conference on Information Technology & Systems (ICITS 2018)","DOI":"10.1007/978-3-319-73450-7_20","editor":[{"family":"Rocha","given":"Álvaro"},{"family":"Guarda","given":"Teresa"}],"event-place":"Cham","ISBN":"978-3-319-73450-7","issued":{"date-parts":[[2018]]},"language":"en","page":"200-210","publisher":"Springer International Publishing","publisher-place":"Cham","source":"Springer Link","title":"Best Practices and Pitfalls in Open Source Hardware","type":"paper-conference"},
  {"id":"narduzzoModularDesignDevelopment","abstract":"Organizational and managerial theories of modularity applied to the design and production of complex artifacts are used to interpret the rise and success of Free/Open Source software methodologies and practices in software engineering. Strengths and risks of the adoption of a modular approach in software project management are introduced and are related to the achievements of various Free/Open Source Software projects (among them: the GNU operating system, the Linux kernel, the HURD kernel). It is suggested that mindful implementation of the principles of modularity may improve the rate of success of many Free/Open Source software projects. Speciﬁc case studies here depicted, as well as indirect observation of common programming practices employed by Free/Open Source developers and users, suggest a possible revision towards an improved theory of modularity that may be extended also to settings different from software production.","author":[{"family":"Narduzzo","given":"Alessandro"},{"family":"Rossi","given":"Alessandro"}],"language":"en","page":"40","source":"Zotero","title":"Modular Design and the Development of Complex Artifacts: Lessons from Free/Open Source Software","type":"article-journal"},
  {"id":"OpenKnowHowManifestOnline","accessed":{"date-parts":[[2021,9,23]]},"title":"OpenKnowHow - Manifest Online Form","type":"webpage","URL":"https://okh.makernet.org/form"},
  {"id":"OpenKnowHowSearch2021","abstract":"A publicly editable list of OKH projects and an associated search page","accessed":{"date-parts":[[2021,9,21]]},"genre":"JavaScript","issued":{"date-parts":[[2021,7,5]]},"original-date":{"date-parts":[[2019,10,6]]},"publisher":"Open Know-How","source":"GitHub","title":"Open Know-How Search - List of Manifest Files 10/2020","type":"book","URL":"https://github.com/OpenKnowHow/okh-search/blob/b9e7301f4e00b4021fa089822983ab36236bafee/projects_okhs.csv"},
  {"id":"OpenKnowHowWebsite","accessed":{"date-parts":[[2021,9,30]]},"title":"Open Know-How Website","type":"webpage","URL":"https://openknowhow.org/"},
  {"id":"OSEGermanyOpenHardware","abstract":"Technology-specific Documentation Criteria (TsDC) specify the requirements for the technical documentation of Open Source Hardware (OSH) in the context of the DIN SPEC 3105.","accessed":{"date-parts":[[2021,9,21]]},"container-title":"GitLab","language":"en","title":"OSEGermany / Open Hardware Standards - TSDC","type":"webpage","URL":"https://gitlab.com/OSEGermany/oh-tsdc"},
  {"id":"OSHWADefinitionEnglish","abstract":"Translations: العَرَبِيةُ, Català, 中文, Français, Deutsch, Ελληνικά, עִבְרִית,  Italiano,  日本語, 한글,  Latina, Português, Español, Svenska The open-source hardware statement of principles and definition were developed by members of the OSHWA board and working group along with others. These documents were originally edited on the wiki at freedomdefined.org, which you can visit to see endorsements of the definition and to add your own. Open Source Hardware (OSHW) Statement of Principles 1.0 Open source…","accessed":{"date-parts":[[2021,3,20]]},"container-title":"Open Source Hardware Association","language":"en-US","title":"OSHWA Definition (English)","type":"webpage","URL":"https://www.oshwa.org/definition/"},
  {"id":"reddyAPIDesign2011","abstract":"API Design for C++ provides a comprehensive discussion of Application Programming Interface (API) development, from initial design through implementation, testing, documentation, release, versioning, maintenance, and deprecation. It is the only book that teaches the strategies of C++ API development, including interface design, versioning, scripting, and plug-in extensibility. Drawing from the author&#39;s experience on large scale, collaborative software projects, the text offers practical techniques of API design that produce robust code for the long term. It presents patterns and practices that provide real value to individual developers as well as organizations. API Design for C++ explores often overlooked issues, both technical and non-technical, contributing to successful design decisions that product high quality, robust, and long-lived APIs. It focuses on various API styles and patterns that will allow you to produce elegant and durable libraries. A discussion on testing strategies concentrates on automated API testing techniques rather than attempting to include end-user application testing techniques such as GUI testing, system testing, or manual testing. Each concept is illustrated with extensive C++ code examples, and fully functional examples and working source code for experimentation are available online. This book will be helpful to new programmers who understand the fundamentals of C++ and who want to advance their design skills, as well as to senior engineers and software architects seeking to gain new expertise to complement their existing talents. Three specific groups of readers are targeted: practicing software engineers and architects, technical managers, and students and educators. The only book that teaches the strategies of C++ API development, including design, versioning, documentation, testing, scripting, and extensibility. Extensive code examples illustrate each concept, with fully functional examples and working source code for experimentation available online.Covers various API styles and patterns with a focus on practical and efficient designs for large-scale long-term projects.","author":[{"family":"Reddy","given":"Martin"}],"ISBN":"978-0-12-385004-1","issued":{"date-parts":[[2011,3,14]]},"language":"en","number-of-pages":"468","publisher":"Elsevier","source":"Google Books","title":"API Design for C++","type":"book"},
  {"id":"ScenariosDigitizingStandardization","language":"en","page":"28","publisher":"DIN/DKE","source":"Zotero","title":"Scenarios for Digitizing Standardization and Standards","type":"report","URL":"https://www.din.de/resource/blob/801106/0251eb1280a9a97e53285d42d3bf1fea/whitepaper-idis-en-data.pdf"},
  {"id":"segaranProgrammingSemanticWeb2009","abstract":"With this book, the promise of the Semantic Web -- in which machines can find, share, and combine data on the Web -- is not just a technical possibility, but a practical reality Programming the Semantic Web demonstrates several ways to implement semantic web applications, using current and emerging standards and technologies. You'll learn how to incorporate existing data sources into semantically aware applications and publish rich semantic data.Each chapter walks you through a single piece of semantic technology and explains how you can use it to solve real problems. Whether you're writing a simple mashup or maintaining a high-performance enterprise solution,Programming the Semantic Web provides a standard, flexible approach for integrating and future-proofing systems and data.This book will help you:Learn how the Semantic Web allows new and unexpected uses of data to emergeUnderstand how semantic technologies promote data portability with a simple, abstract model for knowledge representationBecome familiar with semantic standards, such as the Resource Description Framework (RDF) and the Web Ontology Language (OWL)Make use of semantic programming techniques to both enrich and simplify current web applications","author":[{"family":"Segaran","given":"Toby"},{"family":"Evans","given":"Colin"},{"family":"Taylor","given":"Jamie"}],"ISBN":"978-1-4493-7917-9","issued":{"date-parts":[[2009,7,9]]},"language":"en","number-of-pages":"302","publisher":"O'Reilly Media, Inc.","source":"Google Books","title":"Programming the Semantic Web: Build Flexible Applications with Graph Data","title-short":"Programming the Semantic Web","type":"book"},
  {"id":"StartseiteOSEGermany","abstract":"Der OSE Germany e.V. fördert die Forschung und Wissenschaft, die Erziehung sowie die Volks- und Berufsbildung im Bereich Open Hardware.","accessed":{"date-parts":[[2021,9,30]]},"container-title":"Startseite | OSE-Germany e.V.","language":"de","title":"Startseite | OSE-Germany e.V.","type":"webpage","URL":"https://www.ose-germany.de/"},
  {"id":"SustainableProductsInitiative","accessed":{"date-parts":[[2021,10,5]]},"container-title":"Have your say","language":"en","title":"Sustainable products initiative","type":"webpage","URL":"https://ec.europa.eu/info/law/better-regulation/have-your-say/initiatives/12567-Sustainable-products-initiative/public-consultation_en"},
  {"id":"weiOverviewLinkedData2011","author":[{"family":"Wei","given":"Liu"}],"container-title":"Journal of academic libraries","container-title-short":"Journal of academic libraries","issued":{"date-parts":[[2011]]},"page":"5-12","title":"Overview on Linked Data: Concept, Technology and Implementation [J]","type":"article-journal","volume":"2"}
]
